GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.h
extern volatile CLCIN4PPSbits_t CLCIN4PPSbits __at(0xE23);
// bitfield macros
#define _CLCIN4PPS_PIN_POSN                                 0x0
#define _CLCIN4PPS_PIN_POSITION                             0x0
#define _CLCIN4PPS_PIN_SIZE                                 0x3
#define _CLCIN4PPS_PIN_LENGTH                               0x3
#define _CLCIN4PPS_PIN_MASK                                 0x7
#define _CLCIN4PPS_PORT_POSN                                0x3
#define _CLCIN4PPS_PORT_POSITION                            0x3
#define _CLCIN4PPS_PORT_SIZE                                0x2
#define _CLCIN4PPS_PORT_LENGTH                              0x2
#define _CLCIN4PPS_PORT_MASK                                0x18
#define _CLCIN4PPS_CLCIN4PPS0_POSN                          0x0
#define _CLCIN4PPS_CLCIN4PPS0_POSITION                      0x0
#define _CLCIN4PPS_CLCIN4PPS0_SIZE                          0x1
#define _CLCIN4PPS_CLCIN4PPS0_LENGTH                        0x1
#define _CLCIN4PPS_CLCIN4PPS0_MASK                          0x1
#define _CLCIN4PPS_CLCIN4PPS1_POSN                          0x1
#define _CLCIN4PPS_CLCIN4PPS1_POSITION                      0x1
#define _CLCIN4PPS_CLCIN4PPS1_SIZE                          0x1
#define _CLCIN4PPS_CLCIN4PPS1_LENGTH                        0x1
#define _CLCIN4PPS_CLCIN4PPS1_MASK                          0x2
#define _CLCIN4PPS_CLCIN4PPS2_POSN                          0x2
#define _CLCIN4PPS_CLCIN4PPS2_POSITION                      0x2
#define _CLCIN4PPS_CLCIN4PPS2_SIZE                          0x1
#define _CLCIN4PPS_CLCIN4PPS2_LENGTH                        0x1
#define _CLCIN4PPS_CLCIN4PPS2_MASK                          0x4
#define _CLCIN4PPS_CLCIN4PPS3_POSN                          0x3
#define _CLCIN4PPS_CLCIN4PPS3_POSITION                      0x3
#define _CLCIN4PPS_CLCIN4PPS3_SIZE                          0x1
#define _CLCIN4PPS_CLCIN4PPS3_LENGTH                        0x1
#define _CLCIN4PPS_CLCIN4PPS3_MASK                          0x8
#define _CLCIN4PPS_CLCIN4PPS4_POSN                          0x4
#define _CLCIN4PPS_CLCIN4PPS4_POSITION                      0x4
#define _CLCIN4PPS_CLCIN4PPS4_SIZE                          0x1
#define _CLCIN4PPS_CLCIN4PPS4_LENGTH                        0x1
#define _CLCIN4PPS_CLCIN4PPS4_MASK                          0x10
#define _CLCIN4PPS_CLCIN4PPS_POSN                           0x0
#define _CLCIN4PPS_CLCIN4PPS_POSITION                       0x0
#define _CLCIN4PPS_CLCIN4PPS_SIZE                           0x5
#define _CLCIN4PPS_CLCIN4PPS_LENGTH                         0x5
#define _CLCIN4PPS_CLCIN4PPS_MASK                           0x1F

// Register: CLCIN5PPS
#define CLCIN5PPS CLCIN5PPS
extern volatile unsigned char           CLCIN5PPS           __at(0xE24);
#ifndef _LIB_BUILD
asm("CLCIN5PPS equ 0E24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CLCIN5PPS0             :1;
        unsigned CLCIN5PPS1             :1;
        unsigned CLCIN5PPS2             :1;
        unsigned CLCIN5PPS3             :1;
        unsigned CLCIN5PPS4             :1;
    };
    struct {
        unsigned CLCIN5PPS              :5;
    };
} CLCIN5PPSbits_t;
extern volatile CLCIN5PPSbits_t CLCIN5PPSbits __at(0xE24);
// bitfield macros
#define _CLCIN5PPS_PIN_POSN                                 0x0
#define _CLCIN5PPS_PIN_POSITION                             0x0
#define _CLCIN5PPS_PIN_SIZE                                 0x3
#define _CLCIN5PPS_PIN_LENGTH                               0x3
#define _CLCIN5PPS_PIN_MASK                                 0x7
#define _CLCIN5PPS_PORT_POSN                                0x3
#define _CLCIN5PPS_PORT_POSITION                            0x3
#define _CLCIN5PPS_PORT_SIZE                                0x2
#define _CLCIN5PPS_PORT_LENGTH                              0x2
#define _CLCIN5PPS_PORT_MASK                                0x18
#define _CLCIN5PPS_CLCIN5PPS0_POSN                          0x0
#define _CLCIN5PPS_CLCIN5PPS0_POSITION                      0x0
#define _CLCIN5PPS_CLCIN5PPS0_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS0_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS0_MASK                          0x1
#define _CLCIN5PPS_CLCIN5PPS1_POSN                          0x1
#define _CLCIN5PPS_CLCIN5PPS1_POSITION                      0x1
#define _CLCIN5PPS_CLCIN5PPS1_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS1_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS1_MASK                          0x2
#define _CLCIN5PPS_CLCIN5PPS2_POSN                          0x2
#define _CLCIN5PPS_CLCIN5PPS2_POSITION                      0x2
#define _CLCIN5PPS_CLCIN5PPS2_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS2_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS2_MASK                          0x4
#define _CLCIN5PPS_CLCIN5PPS3_POSN                          0x3
#define _CLCIN5PPS_CLCIN5PPS3_POSITION                      0x3
#define _CLCIN5PPS_CLCIN5PPS3_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS3_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS3_MASK                          0x8
#define _CLCIN5PPS_CLCIN5PPS4_POSN                          0x4
#define _CLCIN5PPS_CLCIN5PPS4_POSITION                      0x4
#define _CLCIN5PPS_CLCIN5PPS4_SIZE                          0x1
#define _CLCIN5PPS_CLCIN5PPS4_LENGTH                        0x1
#define _CLCIN5PPS_CLCIN5PPS4_MASK                          0x10
#define _CLCIN5PPS_CLCIN5PPS_POSN                           0x0
#define _CLCIN5PPS_CLCIN5PPS_POSITION                       0x0
#define _CLCIN5PPS_CLCIN5PPS_SIZE                           0x5
#define _CLCIN5PPS_CLCIN5PPS_LENGTH                         0x5
#define _CLCIN5PPS_CLCIN5PPS_MASK                           0x1F

// Register: CLCIN6PPS
#define CLCIN6PPS CLCIN6PPS
extern volatile unsigned char           CLCIN6PPS           __at(0xE25);
#ifndef _LIB_BUILD
asm("CLCIN6PPS equ 0E25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned CLCIN6PPS0             :1;
        unsigned CLCIN6PPS1             :1;
        unsigned CLCIN6PPS2             :1;
        unsigned CLCIN6PPS3             :1;
        unsigned CLCIN6PPS4             :1;
    };
    struct {
        unsigned CLCIN6PPS              :5;
    };
} CLCIN6PPSbits_t;
