GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.h
extern volatile CLC4GLS1bits_t CLC4GLS1bits __at(0xE4C);
// bitfield macros
#define _CLC4GLS1_G2D1N_POSN                                0x0
#define _CLC4GLS1_G2D1N_POSITION                            0x0
#define _CLC4GLS1_G2D1N_SIZE                                0x1
#define _CLC4GLS1_G2D1N_LENGTH                              0x1
#define _CLC4GLS1_G2D1N_MASK                                0x1
#define _CLC4GLS1_G2D1T_POSN                                0x1
#define _CLC4GLS1_G2D1T_POSITION                            0x1
#define _CLC4GLS1_G2D1T_SIZE                                0x1
#define _CLC4GLS1_G2D1T_LENGTH                              0x1
#define _CLC4GLS1_G2D1T_MASK                                0x2
#define _CLC4GLS1_G2D2N_POSN                                0x2
#define _CLC4GLS1_G2D2N_POSITION                            0x2
#define _CLC4GLS1_G2D2N_SIZE                                0x1
#define _CLC4GLS1_G2D2N_LENGTH                              0x1
#define _CLC4GLS1_G2D2N_MASK                                0x4
#define _CLC4GLS1_G2D2T_POSN                                0x3
#define _CLC4GLS1_G2D2T_POSITION                            0x3
#define _CLC4GLS1_G2D2T_SIZE                                0x1
#define _CLC4GLS1_G2D2T_LENGTH                              0x1
#define _CLC4GLS1_G2D2T_MASK                                0x8
#define _CLC4GLS1_G2D3N_POSN                                0x4
#define _CLC4GLS1_G2D3N_POSITION                            0x4
#define _CLC4GLS1_G2D3N_SIZE                                0x1
#define _CLC4GLS1_G2D3N_LENGTH                              0x1
#define _CLC4GLS1_G2D3N_MASK                                0x10
#define _CLC4GLS1_G2D3T_POSN                                0x5
#define _CLC4GLS1_G2D3T_POSITION                            0x5
#define _CLC4GLS1_G2D3T_SIZE                                0x1
#define _CLC4GLS1_G2D3T_LENGTH                              0x1
#define _CLC4GLS1_G2D3T_MASK                                0x20
#define _CLC4GLS1_G2D4N_POSN                                0x6
#define _CLC4GLS1_G2D4N_POSITION                            0x6
#define _CLC4GLS1_G2D4N_SIZE                                0x1
#define _CLC4GLS1_G2D4N_LENGTH                              0x1
#define _CLC4GLS1_G2D4N_MASK                                0x40
#define _CLC4GLS1_G2D4T_POSN                                0x7
#define _CLC4GLS1_G2D4T_POSITION                            0x7
#define _CLC4GLS1_G2D4T_SIZE                                0x1
#define _CLC4GLS1_G2D4T_LENGTH                              0x1
#define _CLC4GLS1_G2D4T_MASK                                0x80
#define _CLC4GLS1_LC4G2D1N_POSN                             0x0
#define _CLC4GLS1_LC4G2D1N_POSITION                         0x0
#define _CLC4GLS1_LC4G2D1N_SIZE                             0x1
#define _CLC4GLS1_LC4G2D1N_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D1N_MASK                             0x1
#define _CLC4GLS1_LC4G2D1T_POSN                             0x1
#define _CLC4GLS1_LC4G2D1T_POSITION                         0x1
#define _CLC4GLS1_LC4G2D1T_SIZE                             0x1
#define _CLC4GLS1_LC4G2D1T_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D1T_MASK                             0x2
#define _CLC4GLS1_LC4G2D2N_POSN                             0x2
#define _CLC4GLS1_LC4G2D2N_POSITION                         0x2
#define _CLC4GLS1_LC4G2D2N_SIZE                             0x1
#define _CLC4GLS1_LC4G2D2N_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D2N_MASK                             0x4
#define _CLC4GLS1_LC4G2D2T_POSN                             0x3
#define _CLC4GLS1_LC4G2D2T_POSITION                         0x3
#define _CLC4GLS1_LC4G2D2T_SIZE                             0x1
#define _CLC4GLS1_LC4G2D2T_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D2T_MASK                             0x8
#define _CLC4GLS1_LC4G2D3N_POSN                             0x4
#define _CLC4GLS1_LC4G2D3N_POSITION                         0x4
#define _CLC4GLS1_LC4G2D3N_SIZE                             0x1
#define _CLC4GLS1_LC4G2D3N_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D3N_MASK                             0x10
#define _CLC4GLS1_LC4G2D3T_POSN                             0x5
#define _CLC4GLS1_LC4G2D3T_POSITION                         0x5
#define _CLC4GLS1_LC4G2D3T_SIZE                             0x1
#define _CLC4GLS1_LC4G2D3T_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D3T_MASK                             0x20
#define _CLC4GLS1_LC4G2D4N_POSN                             0x6
#define _CLC4GLS1_LC4G2D4N_POSITION                         0x6
#define _CLC4GLS1_LC4G2D4N_SIZE                             0x1
#define _CLC4GLS1_LC4G2D4N_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D4N_MASK                             0x40
#define _CLC4GLS1_LC4G2D4T_POSN                             0x7
#define _CLC4GLS1_LC4G2D4T_POSITION                         0x7
#define _CLC4GLS1_LC4G2D4T_SIZE                             0x1
#define _CLC4GLS1_LC4G2D4T_LENGTH                           0x1
#define _CLC4GLS1_LC4G2D4T_MASK                             0x80

// Register: CLC4GLS2
#define CLC4GLS2 CLC4GLS2
extern volatile unsigned char           CLC4GLS2            __at(0xE4D);
#ifndef _LIB_BUILD
asm("CLC4GLS2 equ 0E4Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G3D1N                  :1;
        unsigned G3D1T                  :1;
        unsigned G3D2N                  :1;
        unsigned G3D2T                  :1;
        unsigned G3D3N                  :1;
        unsigned G3D3T                  :1;
        unsigned G3D4N                  :1;
        unsigned G3D4T                  :1;
    };
    struct {
        unsigned LC4G3D1N               :1;
        unsigned LC4G3D1T               :1;
        unsigned LC4G3D2N               :1;
        unsigned LC4G3D2T               :1;
        unsigned LC4G3D3N               :1;
        unsigned LC4G3D3T               :1;
        unsigned LC4G3D4N               :1;
        unsigned LC4G3D4T               :1;
    };
} CLC4GLS2bits_t;
extern volatile CLC4GLS2bits_t CLC4GLS2bits __at(0xE4D);
// bitfield macros
#define _CLC4GLS2_G3D1N_POSN                                0x0
#define _CLC4GLS2_G3D1N_POSITION                            0x0
#define _CLC4GLS2_G3D1N_SIZE                                0x1
#define _CLC4GLS2_G3D1N_LENGTH                              0x1
#define _CLC4GLS2_G3D1N_MASK                                0x1
#define _CLC4GLS2_G3D1T_POSN                                0x1
#define _CLC4GLS2_G3D1T_POSITION                            0x1
#define _CLC4GLS2_G3D1T_SIZE                                0x1
#define _CLC4GLS2_G3D1T_LENGTH                              0x1
#define _CLC4GLS2_G3D1T_MASK                                0x2
#define _CLC4GLS2_G3D2N_POSN                                0x2
#define _CLC4GLS2_G3D2N_POSITION                            0x2
#define _CLC4GLS2_G3D2N_SIZE                                0x1
#define _CLC4GLS2_G3D2N_LENGTH                              0x1
#define _CLC4GLS2_G3D2N_MASK                                0x4
#define _CLC4GLS2_G3D2T_POSN                                0x3
#define _CLC4GLS2_G3D2T_POSITION                            0x3
#define _CLC4GLS2_G3D2T_SIZE                                0x1
#define _CLC4GLS2_G3D2T_LENGTH                              0x1
#define _CLC4GLS2_G3D2T_MASK                                0x8
#define _CLC4GLS2_G3D3N_POSN                                0x4
#define _CLC4GLS2_G3D3N_POSITION                            0x4
#define _CLC4GLS2_G3D3N_SIZE                                0x1
#define _CLC4GLS2_G3D3N_LENGTH                              0x1
#define _CLC4GLS2_G3D3N_MASK                                0x10
#define _CLC4GLS2_G3D3T_POSN                                0x5
#define _CLC4GLS2_G3D3T_POSITION                            0x5
#define _CLC4GLS2_G3D3T_SIZE                                0x1
#define _CLC4GLS2_G3D3T_LENGTH                              0x1
#define _CLC4GLS2_G3D3T_MASK                                0x20
#define _CLC4GLS2_G3D4N_POSN                                0x6
#define _CLC4GLS2_G3D4N_POSITION                            0x6
#define _CLC4GLS2_G3D4N_SIZE                                0x1
#define _CLC4GLS2_G3D4N_LENGTH                              0x1
#define _CLC4GLS2_G3D4N_MASK                                0x40
#define _CLC4GLS2_G3D4T_POSN                                0x7
#define _CLC4GLS2_G3D4T_POSITION                            0x7
#define _CLC4GLS2_G3D4T_SIZE                                0x1
#define _CLC4GLS2_G3D4T_LENGTH                              0x1
#define _CLC4GLS2_G3D4T_MASK                                0x80
#define _CLC4GLS2_LC4G3D1N_POSN                             0x0
#define _CLC4GLS2_LC4G3D1N_POSITION                         0x0
#define _CLC4GLS2_LC4G3D1N_SIZE                             0x1
#define _CLC4GLS2_LC4G3D1N_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D1N_MASK                             0x1
#define _CLC4GLS2_LC4G3D1T_POSN                             0x1
#define _CLC4GLS2_LC4G3D1T_POSITION                         0x1
#define _CLC4GLS2_LC4G3D1T_SIZE                             0x1
#define _CLC4GLS2_LC4G3D1T_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D1T_MASK                             0x2
#define _CLC4GLS2_LC4G3D2N_POSN                             0x2
#define _CLC4GLS2_LC4G3D2N_POSITION                         0x2
#define _CLC4GLS2_LC4G3D2N_SIZE                             0x1
#define _CLC4GLS2_LC4G3D2N_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D2N_MASK                             0x4
#define _CLC4GLS2_LC4G3D2T_POSN                             0x3
#define _CLC4GLS2_LC4G3D2T_POSITION                         0x3
#define _CLC4GLS2_LC4G3D2T_SIZE                             0x1
#define _CLC4GLS2_LC4G3D2T_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D2T_MASK                             0x8
#define _CLC4GLS2_LC4G3D3N_POSN                             0x4
#define _CLC4GLS2_LC4G3D3N_POSITION                         0x4
#define _CLC4GLS2_LC4G3D3N_SIZE                             0x1
#define _CLC4GLS2_LC4G3D3N_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D3N_MASK                             0x10
#define _CLC4GLS2_LC4G3D3T_POSN                             0x5
#define _CLC4GLS2_LC4G3D3T_POSITION                         0x5
#define _CLC4GLS2_LC4G3D3T_SIZE                             0x1
#define _CLC4GLS2_LC4G3D3T_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D3T_MASK                             0x20
#define _CLC4GLS2_LC4G3D4N_POSN                             0x6
#define _CLC4GLS2_LC4G3D4N_POSITION                         0x6
#define _CLC4GLS2_LC4G3D4N_SIZE                             0x1
#define _CLC4GLS2_LC4G3D4N_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D4N_MASK                             0x40
#define _CLC4GLS2_LC4G3D4T_POSN                             0x7
#define _CLC4GLS2_LC4G3D4T_POSITION                         0x7
#define _CLC4GLS2_LC4G3D4T_SIZE                             0x1
#define _CLC4GLS2_LC4G3D4T_LENGTH                           0x1
#define _CLC4GLS2_LC4G3D4T_MASK                             0x80

// Register: CLC4GLS3
#define CLC4GLS3 CLC4GLS3
extern volatile unsigned char           CLC4GLS3            __at(0xE4E);
#ifndef _LIB_BUILD
asm("CLC4GLS3 equ 0E4Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G4D1N                  :1;
        unsigned G4D1T                  :1;
        unsigned G4D2N                  :1;
        unsigned G4D2T                  :1;
        unsigned G4D3N                  :1;
        unsigned G4D3T                  :1;
        unsigned G4D4N                  :1;
        unsigned G4D4T                  :1;
    };
    struct {
        unsigned LC4G4D1N               :1;
        unsigned LC4G4D1T               :1;
        unsigned LC4G4D2N               :1;
        unsigned LC4G4D2T               :1;
        unsigned LC4G4D3N               :1;
        unsigned LC4G4D3T               :1;
        unsigned LC4G4D4N               :1;
        unsigned LC4G4D4T               :1;
    };
} CLC4GLS3bits_t;
extern volatile CLC4GLS3bits_t CLC4GLS3bits __at(0xE4E);
// bitfield macros
#define _CLC4GLS3_G4D1N_POSN                                0x0
#define _CLC4GLS3_G4D1N_POSITION                            0x0
#define _CLC4GLS3_G4D1N_SIZE                                0x1
#define _CLC4GLS3_G4D1N_LENGTH                              0x1
#define _CLC4GLS3_G4D1N_MASK                                0x1
#define _CLC4GLS3_G4D1T_POSN                                0x1
#define _CLC4GLS3_G4D1T_POSITION                            0x1
#define _CLC4GLS3_G4D1T_SIZE                                0x1
#define _CLC4GLS3_G4D1T_LENGTH                              0x1
#define _CLC4GLS3_G4D1T_MASK                                0x2
#define _CLC4GLS3_G4D2N_POSN                                0x2
#define _CLC4GLS3_G4D2N_POSITION                            0x2
#define _CLC4GLS3_G4D2N_SIZE                                0x1
#define _CLC4GLS3_G4D2N_LENGTH                              0x1
#define _CLC4GLS3_G4D2N_MASK                                0x4
#define _CLC4GLS3_G4D2T_POSN                                0x3
#define _CLC4GLS3_G4D2T_POSITION                            0x3
#define _CLC4GLS3_G4D2T_SIZE                                0x1
#define _CLC4GLS3_G4D2T_LENGTH                              0x1
#define _CLC4GLS3_G4D2T_MASK                                0x8
#define _CLC4GLS3_G4D3N_POSN                                0x4
#define _CLC4GLS3_G4D3N_POSITION                            0x4
#define _CLC4GLS3_G4D3N_SIZE                                0x1
#define _CLC4GLS3_G4D3N_LENGTH                              0x1
#define _CLC4GLS3_G4D3N_MASK                                0x10
#define _CLC4GLS3_G4D3T_POSN                                0x5
#define _CLC4GLS3_G4D3T_POSITION                            0x5
#define _CLC4GLS3_G4D3T_SIZE                                0x1
#define _CLC4GLS3_G4D3T_LENGTH                              0x1
#define _CLC4GLS3_G4D3T_MASK                                0x20
#define _CLC4GLS3_G4D4N_POSN                                0x6
#define _CLC4GLS3_G4D4N_POSITION                            0x6
#define _CLC4GLS3_G4D4N_SIZE                                0x1
#define _CLC4GLS3_G4D4N_LENGTH                              0x1
#define _CLC4GLS3_G4D4N_MASK                                0x40
#define _CLC4GLS3_G4D4T_POSN                                0x7
#define _CLC4GLS3_G4D4T_POSITION                            0x7
#define _CLC4GLS3_G4D4T_SIZE                                0x1
#define _CLC4GLS3_G4D4T_LENGTH                              0x1
#define _CLC4GLS3_G4D4T_MASK                                0x80
#define _CLC4GLS3_LC4G4D1N_POSN                             0x0
#define _CLC4GLS3_LC4G4D1N_POSITION                         0x0
#define _CLC4GLS3_LC4G4D1N_SIZE                             0x1
#define _CLC4GLS3_LC4G4D1N_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D1N_MASK                             0x1
#define _CLC4GLS3_LC4G4D1T_POSN                             0x1
#define _CLC4GLS3_LC4G4D1T_POSITION                         0x1
#define _CLC4GLS3_LC4G4D1T_SIZE                             0x1
#define _CLC4GLS3_LC4G4D1T_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D1T_MASK                             0x2
#define _CLC4GLS3_LC4G4D2N_POSN                             0x2
#define _CLC4GLS3_LC4G4D2N_POSITION                         0x2
#define _CLC4GLS3_LC4G4D2N_SIZE                             0x1
#define _CLC4GLS3_LC4G4D2N_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D2N_MASK                             0x4
#define _CLC4GLS3_LC4G4D2T_POSN                             0x3
#define _CLC4GLS3_LC4G4D2T_POSITION                         0x3
#define _CLC4GLS3_LC4G4D2T_SIZE                             0x1
#define _CLC4GLS3_LC4G4D2T_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D2T_MASK                             0x8
#define _CLC4GLS3_LC4G4D3N_POSN                             0x4
#define _CLC4GLS3_LC4G4D3N_POSITION                         0x4
#define _CLC4GLS3_LC4G4D3N_SIZE                             0x1
#define _CLC4GLS3_LC4G4D3N_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D3N_MASK                             0x10
#define _CLC4GLS3_LC4G4D3T_POSN                             0x5
#define _CLC4GLS3_LC4G4D3T_POSITION                         0x5
#define _CLC4GLS3_LC4G4D3T_SIZE                             0x1
#define _CLC4GLS3_LC4G4D3T_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D3T_MASK                             0x20
#define _CLC4GLS3_LC4G4D4N_POSN                             0x6
#define _CLC4GLS3_LC4G4D4N_POSITION                         0x6
#define _CLC4GLS3_LC4G4D4N_SIZE                             0x1
#define _CLC4GLS3_LC4G4D4N_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D4N_MASK                             0x40
#define _CLC4GLS3_LC4G4D4T_POSN                             0x7
#define _CLC4GLS3_LC4G4D4T_POSITION                         0x7
#define _CLC4GLS3_LC4G4D4T_SIZE                             0x1
#define _CLC4GLS3_LC4G4D4T_LENGTH                           0x1
#define _CLC4GLS3_LC4G4D4T_MASK                             0x80

// Register: CLC5CON
#define CLC5CON CLC5CON
extern volatile unsigned char           CLC5CON             __at(0xE4F);
#ifndef _LIB_BUILD
asm("CLC5CON equ 0E4Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
    struct {
        unsigned LC5MODE                :3;
        unsigned LC5INTN                :1;
        unsigned LC5INTP                :1;
        unsigned LC5OUT                 :1;
        unsigned                        :1;
        unsigned LC5EN                  :1;
    };
    struct {
        unsigned LC5MODE0               :1;
        unsigned LC5MODE1               :1;
        unsigned LC5MODE2               :1;
    };
} CLC5CONbits_t;
extern volatile CLC5CONbits_t CLC5CONbits __at(0xE4F);
// bitfield macros
#define _CLC5CON_MODE_POSN                                  0x0
#define _CLC5CON_MODE_POSITION                              0x0
#define _CLC5CON_MODE_SIZE                                  0x3
#define _CLC5CON_MODE_LENGTH                                0x3
#define _CLC5CON_MODE_MASK                                  0x7
#define _CLC5CON_INTN_POSN                                  0x3
#define _CLC5CON_INTN_POSITION                              0x3
#define _CLC5CON_INTN_SIZE                                  0x1
#define _CLC5CON_INTN_LENGTH                                0x1
#define _CLC5CON_INTN_MASK                                  0x8
#define _CLC5CON_INTP_POSN                                  0x4
#define _CLC5CON_INTP_POSITION                              0x4
#define _CLC5CON_INTP_SIZE                                  0x1
#define _CLC5CON_INTP_LENGTH                                0x1
#define _CLC5CON_INTP_MASK                                  0x10
#define _CLC5CON_OUT_POSN                                   0x5
#define _CLC5CON_OUT_POSITION                               0x5
#define _CLC5CON_OUT_SIZE                                   0x1
#define _CLC5CON_OUT_LENGTH                                 0x1
#define _CLC5CON_OUT_MASK                                   0x20
#define _CLC5CON_EN_POSN                                    0x7
#define _CLC5CON_EN_POSITION                                0x7
#define _CLC5CON_EN_SIZE                                    0x1
#define _CLC5CON_EN_LENGTH                                  0x1
#define _CLC5CON_EN_MASK                                    0x80
#define _CLC5CON_MODE0_POSN                                 0x0
#define _CLC5CON_MODE0_POSITION                             0x0
#define _CLC5CON_MODE0_SIZE                                 0x1
#define _CLC5CON_MODE0_LENGTH                               0x1
#define _CLC5CON_MODE0_MASK                                 0x1
#define _CLC5CON_MODE1_POSN                                 0x1
#define _CLC5CON_MODE1_POSITION                             0x1
#define _CLC5CON_MODE1_SIZE                                 0x1
#define _CLC5CON_MODE1_LENGTH                               0x1
#define _CLC5CON_MODE1_MASK                                 0x2
#define _CLC5CON_MODE2_POSN                                 0x2
#define _CLC5CON_MODE2_POSITION                             0x2
#define _CLC5CON_MODE2_SIZE                                 0x1
#define _CLC5CON_MODE2_LENGTH                               0x1
#define _CLC5CON_MODE2_MASK                                 0x4
#define _CLC5CON_LC5MODE_POSN                               0x0
#define _CLC5CON_LC5MODE_POSITION                           0x0
#define _CLC5CON_LC5MODE_SIZE                               0x3
#define _CLC5CON_LC5MODE_LENGTH                             0x3
#define _CLC5CON_LC5MODE_MASK                               0x7
#define _CLC5CON_LC5INTN_POSN                               0x3
#define _CLC5CON_LC5INTN_POSITION                           0x3
#define _CLC5CON_LC5INTN_SIZE                               0x1
#define _CLC5CON_LC5INTN_LENGTH                             0x1
#define _CLC5CON_LC5INTN_MASK                               0x8
#define _CLC5CON_LC5INTP_POSN                               0x4
#define _CLC5CON_LC5INTP_POSITION                           0x4
#define _CLC5CON_LC5INTP_SIZE                               0x1
#define _CLC5CON_LC5INTP_LENGTH                             0x1
#define _CLC5CON_LC5INTP_MASK                               0x10
#define _CLC5CON_LC5OUT_POSN                                0x5
#define _CLC5CON_LC5OUT_POSITION                            0x5
#define _CLC5CON_LC5OUT_SIZE                                0x1
#define _CLC5CON_LC5OUT_LENGTH                              0x1
#define _CLC5CON_LC5OUT_MASK                                0x20
#define _CLC5CON_LC5EN_POSN                                 0x7
#define _CLC5CON_LC5EN_POSITION                             0x7
#define _CLC5CON_LC5EN_SIZE                                 0x1
#define _CLC5CON_LC5EN_LENGTH                               0x1
#define _CLC5CON_LC5EN_MASK                                 0x80
#define _CLC5CON_LC5MODE0_POSN                              0x0
#define _CLC5CON_LC5MODE0_POSITION                          0x0
#define _CLC5CON_LC5MODE0_SIZE                              0x1
#define _CLC5CON_LC5MODE0_LENGTH                            0x1
#define _CLC5CON_LC5MODE0_MASK                              0x1
#define _CLC5CON_LC5MODE1_POSN                              0x1
#define _CLC5CON_LC5MODE1_POSITION                          0x1
#define _CLC5CON_LC5MODE1_SIZE                              0x1
#define _CLC5CON_LC5MODE1_LENGTH                            0x1
#define _CLC5CON_LC5MODE1_MASK                              0x2
#define _CLC5CON_LC5MODE2_POSN                              0x2
#define _CLC5CON_LC5MODE2_POSITION                          0x2
#define _CLC5CON_LC5MODE2_SIZE                              0x1
#define _CLC5CON_LC5MODE2_LENGTH                            0x1
#define _CLC5CON_LC5MODE2_MASK                              0x4

