GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.h
// Register: CLC8SEL2
#define CLC8SEL2 CLC8SEL2
extern volatile unsigned char           CLC8SEL2            __at(0xE71);
#ifndef _LIB_BUILD
asm("CLC8SEL2 equ 0E71h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D3S                    :8;
    };
    struct {
        unsigned LC8D3S                 :8;
    };
    struct {
        unsigned D3S0                   :1;
        unsigned D3S1                   :1;
        unsigned D3S2                   :1;
        unsigned D3S3                   :1;
        unsigned D3S4                   :1;
        unsigned D3S5                   :1;
        unsigned D3S6                   :1;
        unsigned D3S7                   :1;
    };
    struct {
        unsigned LC8D3S0                :1;
        unsigned LC8D3S1                :1;
        unsigned LC8D3S2                :1;
        unsigned LC8D3S3                :1;
        unsigned LC8D3S4                :1;
        unsigned LC8D3S5                :1;
        unsigned LC8D3S6                :1;
        unsigned LC8D3S7                :1;
    };
} CLC8SEL2bits_t;
extern volatile CLC8SEL2bits_t CLC8SEL2bits __at(0xE71);
// bitfield macros
#define _CLC8SEL2_D3S_POSN                                  0x0
#define _CLC8SEL2_D3S_POSITION                              0x0
#define _CLC8SEL2_D3S_SIZE                                  0x8
#define _CLC8SEL2_D3S_LENGTH                                0x8
#define _CLC8SEL2_D3S_MASK                                  0xFF
#define _CLC8SEL2_LC8D3S_POSN                               0x0
#define _CLC8SEL2_LC8D3S_POSITION                           0x0
#define _CLC8SEL2_LC8D3S_SIZE                               0x8
#define _CLC8SEL2_LC8D3S_LENGTH                             0x8
#define _CLC8SEL2_LC8D3S_MASK                               0xFF
#define _CLC8SEL2_D3S0_POSN                                 0x0
#define _CLC8SEL2_D3S0_POSITION                             0x0
#define _CLC8SEL2_D3S0_SIZE                                 0x1
#define _CLC8SEL2_D3S0_LENGTH                               0x1
#define _CLC8SEL2_D3S0_MASK                                 0x1
#define _CLC8SEL2_D3S1_POSN                                 0x1
#define _CLC8SEL2_D3S1_POSITION                             0x1
#define _CLC8SEL2_D3S1_SIZE                                 0x1
#define _CLC8SEL2_D3S1_LENGTH                               0x1
#define _CLC8SEL2_D3S1_MASK                                 0x2
#define _CLC8SEL2_D3S2_POSN                                 0x2
#define _CLC8SEL2_D3S2_POSITION                             0x2
#define _CLC8SEL2_D3S2_SIZE                                 0x1
#define _CLC8SEL2_D3S2_LENGTH                               0x1
#define _CLC8SEL2_D3S2_MASK                                 0x4
#define _CLC8SEL2_D3S3_POSN                                 0x3
#define _CLC8SEL2_D3S3_POSITION                             0x3
#define _CLC8SEL2_D3S3_SIZE                                 0x1
#define _CLC8SEL2_D3S3_LENGTH                               0x1
#define _CLC8SEL2_D3S3_MASK                                 0x8
#define _CLC8SEL2_D3S4_POSN                                 0x4
#define _CLC8SEL2_D3S4_POSITION                             0x4
#define _CLC8SEL2_D3S4_SIZE                                 0x1
#define _CLC8SEL2_D3S4_LENGTH                               0x1
#define _CLC8SEL2_D3S4_MASK                                 0x10
#define _CLC8SEL2_D3S5_POSN                                 0x5
#define _CLC8SEL2_D3S5_POSITION                             0x5
#define _CLC8SEL2_D3S5_SIZE                                 0x1
#define _CLC8SEL2_D3S5_LENGTH                               0x1
#define _CLC8SEL2_D3S5_MASK                                 0x20
#define _CLC8SEL2_D3S6_POSN                                 0x6
#define _CLC8SEL2_D3S6_POSITION                             0x6
#define _CLC8SEL2_D3S6_SIZE                                 0x1
#define _CLC8SEL2_D3S6_LENGTH                               0x1
#define _CLC8SEL2_D3S6_MASK                                 0x40
#define _CLC8SEL2_D3S7_POSN                                 0x7
#define _CLC8SEL2_D3S7_POSITION                             0x7
#define _CLC8SEL2_D3S7_SIZE                                 0x1
#define _CLC8SEL2_D3S7_LENGTH                               0x1
#define _CLC8SEL2_D3S7_MASK                                 0x80
#define _CLC8SEL2_LC8D3S0_POSN                              0x0
#define _CLC8SEL2_LC8D3S0_POSITION                          0x0
#define _CLC8SEL2_LC8D3S0_SIZE                              0x1
#define _CLC8SEL2_LC8D3S0_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S0_MASK                              0x1
#define _CLC8SEL2_LC8D3S1_POSN                              0x1
#define _CLC8SEL2_LC8D3S1_POSITION                          0x1
#define _CLC8SEL2_LC8D3S1_SIZE                              0x1
#define _CLC8SEL2_LC8D3S1_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S1_MASK                              0x2
#define _CLC8SEL2_LC8D3S2_POSN                              0x2
#define _CLC8SEL2_LC8D3S2_POSITION                          0x2
#define _CLC8SEL2_LC8D3S2_SIZE                              0x1
#define _CLC8SEL2_LC8D3S2_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S2_MASK                              0x4
#define _CLC8SEL2_LC8D3S3_POSN                              0x3
#define _CLC8SEL2_LC8D3S3_POSITION                          0x3
#define _CLC8SEL2_LC8D3S3_SIZE                              0x1
#define _CLC8SEL2_LC8D3S3_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S3_MASK                              0x8
#define _CLC8SEL2_LC8D3S4_POSN                              0x4
#define _CLC8SEL2_LC8D3S4_POSITION                          0x4
#define _CLC8SEL2_LC8D3S4_SIZE                              0x1
#define _CLC8SEL2_LC8D3S4_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S4_MASK                              0x10
#define _CLC8SEL2_LC8D3S5_POSN                              0x5
#define _CLC8SEL2_LC8D3S5_POSITION                          0x5
#define _CLC8SEL2_LC8D3S5_SIZE                              0x1
#define _CLC8SEL2_LC8D3S5_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S5_MASK                              0x20
#define _CLC8SEL2_LC8D3S6_POSN                              0x6
#define _CLC8SEL2_LC8D3S6_POSITION                          0x6
#define _CLC8SEL2_LC8D3S6_SIZE                              0x1
#define _CLC8SEL2_LC8D3S6_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S6_MASK                              0x40
#define _CLC8SEL2_LC8D3S7_POSN                              0x7
#define _CLC8SEL2_LC8D3S7_POSITION                          0x7
#define _CLC8SEL2_LC8D3S7_SIZE                              0x1
#define _CLC8SEL2_LC8D3S7_LENGTH                            0x1
#define _CLC8SEL2_LC8D3S7_MASK                              0x80

// Register: CLC8SEL3
#define CLC8SEL3 CLC8SEL3
extern volatile unsigned char           CLC8SEL3            __at(0xE72);
#ifndef _LIB_BUILD
asm("CLC8SEL3 equ 0E72h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned D4S                    :8;
    };
    struct {
        unsigned LC8D4S                 :8;
    };
    struct {
        unsigned D4S0                   :1;
        unsigned D4S1                   :1;
        unsigned D4S2                   :1;
        unsigned D4S3                   :1;
        unsigned D4S4                   :1;
        unsigned D4S5                   :1;
        unsigned D4S6                   :1;
        unsigned D4S7                   :1;
    };
    struct {
        unsigned LC8D4S0                :1;
        unsigned LC8D4S1                :1;
        unsigned LC8D4S2                :1;
        unsigned LC8D4S3                :1;
        unsigned LC8D4S4                :1;
        unsigned LC8D4S5                :1;
        unsigned LC8D4S6                :1;
        unsigned LC8D4S7                :1;
    };
} CLC8SEL3bits_t;
