GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.h
extern volatile PIE7bits_t PIE7bits __at(0xEC4);
// bitfield macros
#define _PIE7_CWGIE_POSN                                    0x0
#define _PIE7_CWGIE_POSITION                                0x0
#define _PIE7_CWGIE_SIZE                                    0x1
#define _PIE7_CWGIE_LENGTH                                  0x1
#define _PIE7_CWGIE_MASK                                    0x1
#define _PIE7_NVMIE_POSN                                    0x5
#define _PIE7_NVMIE_POSITION                                0x5
#define _PIE7_NVMIE_SIZE                                    0x1
#define _PIE7_NVMIE_LENGTH                                  0x1
#define _PIE7_NVMIE_MASK                                    0x20
#define _PIE7_CRCIE_POSN                                    0x6
#define _PIE7_CRCIE_POSITION                                0x6
#define _PIE7_CRCIE_SIZE                                    0x1
#define _PIE7_CRCIE_LENGTH                                  0x1
#define _PIE7_CRCIE_MASK                                    0x40
#define _PIE7_SCANIE_POSN                                   0x7
#define _PIE7_SCANIE_POSITION                               0x7
#define _PIE7_SCANIE_SIZE                                   0x1
#define _PIE7_SCANIE_LENGTH                                 0x1
#define _PIE7_SCANIE_MASK                                   0x80
#define _PIE7_CWG1IE_POSN                                   0x0
#define _PIE7_CWG1IE_POSITION                               0x0
#define _PIE7_CWG1IE_SIZE                                   0x1
#define _PIE7_CWG1IE_LENGTH                                 0x1
#define _PIE7_CWG1IE_MASK                                   0x1

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0xEC5);
#ifndef _LIB_BUILD
asm("PIR0 equ 0EC5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned INT1IF                 :1;
        unsigned INT2IF                 :1;
        unsigned                        :1;
        unsigned IOCIF                  :1;
        unsigned TMR0IF                 :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0xEC5);
// bitfield macros
#define _PIR0_INT0IF_POSN                                   0x0
#define _PIR0_INT0IF_POSITION                               0x0
#define _PIR0_INT0IF_SIZE                                   0x1
#define _PIR0_INT0IF_LENGTH                                 0x1
#define _PIR0_INT0IF_MASK                                   0x1
#define _PIR0_INT1IF_POSN                                   0x1
#define _PIR0_INT1IF_POSITION                               0x1
#define _PIR0_INT1IF_SIZE                                   0x1
#define _PIR0_INT1IF_LENGTH                                 0x1
#define _PIR0_INT1IF_MASK                                   0x2
#define _PIR0_INT2IF_POSN                                   0x2
#define _PIR0_INT2IF_POSITION                               0x2
#define _PIR0_INT2IF_SIZE                                   0x1
#define _PIR0_INT2IF_LENGTH                                 0x1
#define _PIR0_INT2IF_MASK                                   0x4
#define _PIR0_IOCIF_POSN                                    0x4
#define _PIR0_IOCIF_POSITION                                0x4
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x10
#define _PIR0_TMR0IF_POSN                                   0x5
#define _PIR0_TMR0IF_POSITION                               0x5
#define _PIR0_TMR0IF_SIZE                                   0x1
#define _PIR0_TMR0IF_LENGTH                                 0x1
#define _PIR0_TMR0IF_MASK                                   0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0xEC6);
#ifndef _LIB_BUILD
asm("PIR1 equ 0EC6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADIF                   :1;
        unsigned ADTIF                  :1;
        unsigned                        :4;
        unsigned CSWIF                  :1;
        unsigned OSCFIF                 :1;
    };
} PIR1bits_t;
extern volatile PIR1bits_t PIR1bits __at(0xEC6);
// bitfield macros
#define _PIR1_ADIF_POSN                                     0x0
#define _PIR1_ADIF_POSITION                                 0x0
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x1
#define _PIR1_ADTIF_POSN                                    0x1
#define _PIR1_ADTIF_POSITION                                0x1
#define _PIR1_ADTIF_SIZE                                    0x1
#define _PIR1_ADTIF_LENGTH                                  0x1
#define _PIR1_ADTIF_MASK                                    0x2
#define _PIR1_CSWIF_POSN                                    0x6
#define _PIR1_CSWIF_POSITION                                0x6
#define _PIR1_CSWIF_SIZE                                    0x1
#define _PIR1_CSWIF_LENGTH                                  0x1
#define _PIR1_CSWIF_MASK                                    0x40
#define _PIR1_OSCFIF_POSN                                   0x7
#define _PIR1_OSCFIF_POSITION                               0x7
#define _PIR1_OSCFIF_SIZE                                   0x1
#define _PIR1_OSCFIF_LENGTH                                 0x1
#define _PIR1_OSCFIF_MASK                                   0x80

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0xEC7);
#ifndef _LIB_BUILD
asm("PIR2 equ 0EC7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1IF                   :1;
        unsigned C2IF                   :1;
        unsigned                        :4;
        unsigned ZCDIF                  :1;
        unsigned HLVDIF                 :1;
    };
} PIR2bits_t;
