GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.h
extern volatile __bit                   CAL03               __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 CAL03_bit           _BIT_ACCESS(TMR3L,0)
// TMR5L<CAL05>
extern volatile __bit                   CAL05               __at(0x7E00);	// @ (0xFC0 * 8 + 0)
#define                                 CAL05_bit           _BIT_ACCESS(TMR5L,0)
// TMR1L<CAL11>
extern volatile __bit                   CAL11               __at(0x7E61);	// @ (0xFCC * 8 + 1)
#define                                 CAL11_bit           _BIT_ACCESS(TMR1L,1)
// TMR3L<CAL13>
extern volatile __bit                   CAL13               __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 CAL13_bit           _BIT_ACCESS(TMR3L,1)
// TMR5L<CAL15>
extern volatile __bit                   CAL15               __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 CAL15_bit           _BIT_ACCESS(TMR5L,1)
// TMR1L<CAL21>
extern volatile __bit                   CAL21               __at(0x7E62);	// @ (0xFCC * 8 + 2)
#define                                 CAL21_bit           _BIT_ACCESS(TMR1L,2)
// TMR3L<CAL23>
extern volatile __bit                   CAL23               __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 CAL23_bit           _BIT_ACCESS(TMR3L,2)
// TMR5L<CAL25>
extern volatile __bit                   CAL25               __at(0x7E02);	// @ (0xFC0 * 8 + 2)
#define                                 CAL25_bit           _BIT_ACCESS(TMR5L,2)
// TMR1L<CAL31>
extern volatile __bit                   CAL31               __at(0x7E63);	// @ (0xFCC * 8 + 3)
#define                                 CAL31_bit           _BIT_ACCESS(TMR1L,3)
// TMR3L<CAL33>
extern volatile __bit                   CAL33               __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 CAL33_bit           _BIT_ACCESS(TMR3L,3)
// TMR5L<CAL35>
extern volatile __bit                   CAL35               __at(0x7E03);	// @ (0xFC0 * 8 + 3)
#define                                 CAL35_bit           _BIT_ACCESS(TMR5L,3)
// TMR1L<CAL41>
extern volatile __bit                   CAL41               __at(0x7E64);	// @ (0xFCC * 8 + 4)
#define                                 CAL41_bit           _BIT_ACCESS(TMR1L,4)
// TMR3L<CAL43>
extern volatile __bit                   CAL43               __at(0x7E34);	// @ (0xFC6 * 8 + 4)
#define                                 CAL43_bit           _BIT_ACCESS(TMR3L,4)
// TMR5L<CAL45>
extern volatile __bit                   CAL45               __at(0x7E04);	// @ (0xFC0 * 8 + 4)
#define                                 CAL45_bit           _BIT_ACCESS(TMR5L,4)
// TMR1L<CAL51>
extern volatile __bit                   CAL51               __at(0x7E65);	// @ (0xFCC * 8 + 5)
#define                                 CAL51_bit           _BIT_ACCESS(TMR1L,5)
// TMR3L<CAL53>
extern volatile __bit                   CAL53               __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 CAL53_bit           _BIT_ACCESS(TMR3L,5)
// TMR5L<CAL55>
extern volatile __bit                   CAL55               __at(0x7E05);	// @ (0xFC0 * 8 + 5)
#define                                 CAL55_bit           _BIT_ACCESS(TMR5L,5)
// TMR1L<CAL61>
extern volatile __bit                   CAL61               __at(0x7E66);	// @ (0xFCC * 8 + 6)
#define                                 CAL61_bit           _BIT_ACCESS(TMR1L,6)
// TMR3L<CAL63>
extern volatile __bit                   CAL63               __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 CAL63_bit           _BIT_ACCESS(TMR3L,6)
// TMR5L<CAL65>
extern volatile __bit                   CAL65               __at(0x7E06);	// @ (0xFC0 * 8 + 6)
#define                                 CAL65_bit           _BIT_ACCESS(TMR5L,6)
// TMR1L<CAL71>
extern volatile __bit                   CAL71               __at(0x7E67);	// @ (0xFCC * 8 + 7)
#define                                 CAL71_bit           _BIT_ACCESS(TMR1L,7)
// TMR3L<CAL73>
extern volatile __bit                   CAL73               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 CAL73_bit           _BIT_ACCESS(TMR3L,7)
// TMR5L<CAL75>
extern volatile __bit                   CAL75               __at(0x7E07);	// @ (0xFC0 * 8 + 7)
#define                                 CAL75_bit           _BIT_ACCESS(TMR5L,7)
// CCP1CAP<CCP1CTS0>
extern volatile __bit                   CCP1CTS0            __at(0x7D60);	// @ (0xFAC * 8 + 0)
#define                                 CCP1CTS0_bit        _BIT_ACCESS(CCP1CAP,0)
// CCP1CAP<CCP1CTS1>
extern volatile __bit                   CCP1CTS1            __at(0x7D61);	// @ (0xFAC * 8 + 1)
#define                                 CCP1CTS1_bit        _BIT_ACCESS(CCP1CAP,1)
// CCP1CON<CCP1EN>
extern volatile __bit                   CCP1EN              __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 CCP1EN_bit          _BIT_ACCESS(CCP1CON,7)
// CCP1CON<CCP1FMT>
extern volatile __bit                   CCP1FMT             __at(0x7D5C);	// @ (0xFAB * 8 + 4)
#define                                 CCP1FMT_bit         _BIT_ACCESS(CCP1CON,4)
// PIE6<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7618);	// @ (0xEC3 * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE6,0)
// PIR6<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7658);	// @ (0xECB * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR6,0)
// IPR6<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x75D8);	// @ (0xEBB * 8 + 0)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR6,0)
// PMD3<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x76F8);	// @ (0xEDF * 8 + 0)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD3,0)
// CCP1CON<CCP1MODE0>
extern volatile __bit                   CCP1MODE0           __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 CCP1MODE0_bit       _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1MODE1>
extern volatile __bit                   CCP1MODE1           __at(0x7D59);	// @ (0xFAB * 8 + 1)
#define                                 CCP1MODE1_bit       _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1MODE2>
extern volatile __bit                   CCP1MODE2           __at(0x7D5A);	// @ (0xFAB * 8 + 2)
#define                                 CCP1MODE2_bit       _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1MODE3>
extern volatile __bit                   CCP1MODE3           __at(0x7D5B);	// @ (0xFAB * 8 + 3)
#define                                 CCP1MODE3_bit       _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1OUT>
extern volatile __bit                   CCP1OUT             __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 CCP1OUT_bit         _BIT_ACCESS(CCP1CON,5)
// CCP1PPS<CCP1PPS0>
extern volatile __bit                   CCP1PPS0            __at(0x7550);	// @ (0xEAA * 8 + 0)
#define                                 CCP1PPS0_bit        _BIT_ACCESS(CCP1PPS,0)
// CCP1PPS<CCP1PPS1>
extern volatile __bit                   CCP1PPS1            __at(0x7551);	// @ (0xEAA * 8 + 1)
#define                                 CCP1PPS1_bit        _BIT_ACCESS(CCP1PPS,1)
// CCP1PPS<CCP1PPS2>
extern volatile __bit                   CCP1PPS2            __at(0x7552);	// @ (0xEAA * 8 + 2)
#define                                 CCP1PPS2_bit        _BIT_ACCESS(CCP1PPS,2)
// CCP1PPS<CCP1PPS3>
extern volatile __bit                   CCP1PPS3            __at(0x7553);	// @ (0xEAA * 8 + 3)
#define                                 CCP1PPS3_bit        _BIT_ACCESS(CCP1PPS,3)
// CCP1PPS<CCP1PPS4>
extern volatile __bit                   CCP1PPS4            __at(0x7554);	// @ (0xEAA * 8 + 4)
#define                                 CCP1PPS4_bit        _BIT_ACCESS(CCP1PPS,4)
// CCP2CAP<CCP2CTS0>
extern volatile __bit                   CCP2CTS0            __at(0x7D40);	// @ (0xFA8 * 8 + 0)
#define                                 CCP2CTS0_bit        _BIT_ACCESS(CCP2CAP,0)
// CCP2CAP<CCP2CTS1>
extern volatile __bit                   CCP2CTS1            __at(0x7D41);	// @ (0xFA8 * 8 + 1)
#define                                 CCP2CTS1_bit        _BIT_ACCESS(CCP2CAP,1)
// CCP2CON<CCP2EN>
extern volatile __bit                   CCP2EN              __at(0x7D3F);	// @ (0xFA7 * 8 + 7)
#define                                 CCP2EN_bit          _BIT_ACCESS(CCP2CON,7)
// CCP2CON<CCP2FMT>
extern volatile __bit                   CCP2FMT             __at(0x7D3C);	// @ (0xFA7 * 8 + 4)
#define                                 CCP2FMT_bit         _BIT_ACCESS(CCP2CON,4)
// PIE6<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7619);	// @ (0xEC3 * 8 + 1)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE6,1)
// PIR6<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7659);	// @ (0xECB * 8 + 1)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR6,1)
// IPR6<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x75D9);	// @ (0xEBB * 8 + 1)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR6,1)
// PMD3<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x76F9);	// @ (0xEDF * 8 + 1)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD3,1)
// CCP2CON<CCP2MODE0>
extern volatile __bit                   CCP2MODE0           __at(0x7D38);	// @ (0xFA7 * 8 + 0)
#define                                 CCP2MODE0_bit       _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2MODE1>
extern volatile __bit                   CCP2MODE1           __at(0x7D39);	// @ (0xFA7 * 8 + 1)
#define                                 CCP2MODE1_bit       _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2MODE2>
extern volatile __bit                   CCP2MODE2           __at(0x7D3A);	// @ (0xFA7 * 8 + 2)
#define                                 CCP2MODE2_bit       _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2MODE3>
extern volatile __bit                   CCP2MODE3           __at(0x7D3B);	// @ (0xFA7 * 8 + 3)
#define                                 CCP2MODE3_bit       _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2OUT>
extern volatile __bit                   CCP2OUT             __at(0x7D3D);	// @ (0xFA7 * 8 + 5)
#define                                 CCP2OUT_bit         _BIT_ACCESS(CCP2CON,5)
// CCP2PPS<CCP2PPS0>
extern volatile __bit                   CCP2PPS0            __at(0x7558);	// @ (0xEAB * 8 + 0)
#define                                 CCP2PPS0_bit        _BIT_ACCESS(CCP2PPS,0)
// CCP2PPS<CCP2PPS1>
extern volatile __bit                   CCP2PPS1            __at(0x7559);	// @ (0xEAB * 8 + 1)
#define                                 CCP2PPS1_bit        _BIT_ACCESS(CCP2PPS,1)
// CCP2PPS<CCP2PPS2>
extern volatile __bit                   CCP2PPS2            __at(0x755A);	// @ (0xEAB * 8 + 2)
#define                                 CCP2PPS2_bit        _BIT_ACCESS(CCP2PPS,2)
// CCP2PPS<CCP2PPS3>
extern volatile __bit                   CCP2PPS3            __at(0x755B);	// @ (0xEAB * 8 + 3)
#define                                 CCP2PPS3_bit        _BIT_ACCESS(CCP2PPS,3)
// CCP2PPS<CCP2PPS4>
extern volatile __bit                   CCP2PPS4            __at(0x755C);	// @ (0xEAB * 8 + 4)
#define                                 CCP2PPS4_bit        _BIT_ACCESS(CCP2PPS,4)
// FVRCON<CDAFVR0>
extern volatile __bit                   CDAFVR0             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 CDAFVR0_bit         _BIT_ACCESS(FVRCON,2)
// FVRCON<CDAFVR1>
extern volatile __bit                   CDAFVR1             __at(0x7963);	// @ (0xF2C * 8 + 3)
#define                                 CDAFVR1_bit         _BIT_ACCESS(FVRCON,3)
// OSCCON2<CDIV0>
extern volatile __bit                   CDIV0               __at(0x76A0);	// @ (0xED4 * 8 + 0)
#define                                 CDIV0_bit           _BIT_ACCESS(OSCCON2,0)
// OSCCON2<CDIV1>
extern volatile __bit                   CDIV1               __at(0x76A1);	// @ (0xED4 * 8 + 1)
#define                                 CDIV1_bit           _BIT_ACCESS(OSCCON2,1)
// OSCCON2<CDIV2>
extern volatile __bit                   CDIV2               __at(0x76A2);	// @ (0xED4 * 8 + 2)
#define                                 CDIV2_bit           _BIT_ACCESS(OSCCON2,2)
// OSCCON2<CDIV3>
extern volatile __bit                   CDIV3               __at(0x76A3);	// @ (0xED4 * 8 + 3)
#define                                 CDIV3_bit           _BIT_ACCESS(OSCCON2,3)
// MDCON1<CHPOL>
extern volatile __bit                   CHPOL               __at(0x7A6D);	// @ (0xF4D * 8 + 5)
#define                                 CHPOL_bit           _BIT_ACCESS(MDCON1,5)
// MDCARH<CHS0>
extern volatile __bit                   CHS0                __at(0x7A80);	// @ (0xF50 * 8 + 0)
#define                                 CHS0_bit            _BIT_ACCESS(MDCARH,0)
// MDCARH<CHS1>
extern volatile __bit                   CHS1                __at(0x7A81);	// @ (0xF50 * 8 + 1)
#define                                 CHS1_bit            _BIT_ACCESS(MDCARH,1)
// MDCARH<CHS2>
extern volatile __bit                   CHS2                __at(0x7A82);	// @ (0xF50 * 8 + 2)
#define                                 CHS2_bit            _BIT_ACCESS(MDCARH,2)
// MDCON1<CHSYNC>
extern volatile __bit                   CHSYNC              __at(0x7A6C);	// @ (0xF4D * 8 + 4)
#define                                 CHSYNC_bit          _BIT_ACCESS(MDCON1,4)
// CK2PPS<CK2PPS0>
extern volatile __bit                   CK2PPS0             __at(0x7448);	// @ (0xE89 * 8 + 0)
#define                                 CK2PPS0_bit         _BIT_ACCESS(CK2PPS,0)
// CK2PPS<CK2PPS1>
extern volatile __bit                   CK2PPS1             __at(0x7449);	// @ (0xE89 * 8 + 1)
#define                                 CK2PPS1_bit         _BIT_ACCESS(CK2PPS,1)
// CK2PPS<CK2PPS2>
extern volatile __bit                   CK2PPS2             __at(0x744A);	// @ (0xE89 * 8 + 2)
#define                                 CK2PPS2_bit         _BIT_ACCESS(CK2PPS,2)
// CK2PPS<CK2PPS3>
extern volatile __bit                   CK2PPS3             __at(0x744B);	// @ (0xE89 * 8 + 3)
#define                                 CK2PPS3_bit         _BIT_ACCESS(CK2PPS,3)
// CK2PPS<CK2PPS4>
extern volatile __bit                   CK2PPS4             __at(0x744C);	// @ (0xE89 * 8 + 4)
#define                                 CK2PPS4_bit         _BIT_ACCESS(CK2PPS,4)
// SSP1STAT<CKE1>
extern volatile __bit                   CKE1                __at(0x7CA6);	// @ (0xF94 * 8 + 6)
#define                                 CKE1_bit            _BIT_ACCESS(SSP1STAT,6)
// SSP2STAT<CKE2>
extern volatile __bit                   CKE2                __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 CKE2_bit            _BIT_ACCESS(SSP2STAT,6)
// SSP1CON1<CKP1>
extern volatile __bit                   CKP1                __at(0x7CAC);	// @ (0xF95 * 8 + 4)
#define                                 CKP1_bit            _BIT_ACCESS(SSP1CON1,4)
// SSP2CON1<CKP2>
extern volatile __bit                   CKP2                __at(0x748C);	// @ (0xE91 * 8 + 4)
#define                                 CKP2_bit            _BIT_ACCESS(SSP2CON1,4)
// PIE5<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x7614);	// @ (0xEC2 * 8 + 4)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE5,4)
// PIR5<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x7654);	// @ (0xECA * 8 + 4)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR5,4)
// IPR5<CLC1IP>
extern volatile __bit                   CLC1IP              __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 CLC1IP_bit          _BIT_ACCESS(IPR5,4)
// PMD5<CLC1MD>
extern volatile __bit                   CLC1MD              __at(0x770C);	// @ (0xEE1 * 8 + 4)
#define                                 CLC1MD_bit          _BIT_ACCESS(PMD5,4)
// PIE5<CLC2IE>
extern volatile __bit                   CLC2IE              __at(0x7615);	// @ (0xEC2 * 8 + 5)
#define                                 CLC2IE_bit          _BIT_ACCESS(PIE5,5)
// PIR5<CLC2IF>
extern volatile __bit                   CLC2IF              __at(0x7655);	// @ (0xECA * 8 + 5)
#define                                 CLC2IF_bit          _BIT_ACCESS(PIR5,5)
// IPR5<CLC2IP>
extern volatile __bit                   CLC2IP              __at(0x75D5);	// @ (0xEBA * 8 + 5)
#define                                 CLC2IP_bit          _BIT_ACCESS(IPR5,5)
// PMD5<CLC2MD>
extern volatile __bit                   CLC2MD              __at(0x770D);	// @ (0xEE1 * 8 + 5)
#define                                 CLC2MD_bit          _BIT_ACCESS(PMD5,5)
// PIE5<CLC3IE>
extern volatile __bit                   CLC3IE              __at(0x7616);	// @ (0xEC2 * 8 + 6)
#define                                 CLC3IE_bit          _BIT_ACCESS(PIE5,6)
// PIR5<CLC3IF>
extern volatile __bit                   CLC3IF              __at(0x7656);	// @ (0xECA * 8 + 6)
#define                                 CLC3IF_bit          _BIT_ACCESS(PIR5,6)
// IPR5<CLC3IP>
extern volatile __bit                   CLC3IP              __at(0x75D6);	// @ (0xEBA * 8 + 6)
#define                                 CLC3IP_bit          _BIT_ACCESS(IPR5,6)
// PMD5<CLC3MD>
extern volatile __bit                   CLC3MD              __at(0x770E);	// @ (0xEE1 * 8 + 6)
#define                                 CLC3MD_bit          _BIT_ACCESS(PMD5,6)
// PIE5<CLC4IE>
extern volatile __bit                   CLC4IE              __at(0x7617);	// @ (0xEC2 * 8 + 7)
#define                                 CLC4IE_bit          _BIT_ACCESS(PIE5,7)
// PIR5<CLC4IF>
extern volatile __bit                   CLC4IF              __at(0x7657);	// @ (0xECA * 8 + 7)
#define                                 CLC4IF_bit          _BIT_ACCESS(PIR5,7)
// IPR5<CLC4IP>
extern volatile __bit                   CLC4IP              __at(0x75D7);	// @ (0xEBA * 8 + 7)
#define                                 CLC4IP_bit          _BIT_ACCESS(IPR5,7)
// PMD5<CLC4MD>
extern volatile __bit                   CLC4MD              __at(0x770F);	// @ (0xEE1 * 8 + 7)
#define                                 CLC4MD_bit          _BIT_ACCESS(PMD5,7)
// PIE6<CLC5IE>
extern volatile __bit                   CLC5IE              __at(0x761C);	// @ (0xEC3 * 8 + 4)
#define                                 CLC5IE_bit          _BIT_ACCESS(PIE6,4)
// PIR6<CLC5IF>
extern volatile __bit                   CLC5IF              __at(0x765C);	// @ (0xECB * 8 + 4)
#define                                 CLC5IF_bit          _BIT_ACCESS(PIR6,4)
// IPR6<CLC5IP>
extern volatile __bit                   CLC5IP              __at(0x75DC);	// @ (0xEBB * 8 + 4)
#define                                 CLC5IP_bit          _BIT_ACCESS(IPR6,4)
// PMD3<CLC5MD>
extern volatile __bit                   CLC5MD              __at(0x76FC);	// @ (0xEDF * 8 + 4)
#define                                 CLC5MD_bit          _BIT_ACCESS(PMD3,4)
// PIE6<CLC6IE>
extern volatile __bit                   CLC6IE              __at(0x761D);	// @ (0xEC3 * 8 + 5)
#define                                 CLC6IE_bit          _BIT_ACCESS(PIE6,5)
// PIR6<CLC6IF>
extern volatile __bit                   CLC6IF              __at(0x765D);	// @ (0xECB * 8 + 5)
#define                                 CLC6IF_bit          _BIT_ACCESS(PIR6,5)
// IPR6<CLC6IP>
extern volatile __bit                   CLC6IP              __at(0x75DD);	// @ (0xEBB * 8 + 5)
#define                                 CLC6IP_bit          _BIT_ACCESS(IPR6,5)
// PMD3<CLC6MD>
extern volatile __bit                   CLC6MD              __at(0x76FD);	// @ (0xEDF * 8 + 5)
#define                                 CLC6MD_bit          _BIT_ACCESS(PMD3,5)
// PIE6<CLC7IE>
extern volatile __bit                   CLC7IE              __at(0x761E);	// @ (0xEC3 * 8 + 6)
#define                                 CLC7IE_bit          _BIT_ACCESS(PIE6,6)
// PIR6<CLC7IF>
extern volatile __bit                   CLC7IF              __at(0x765E);	// @ (0xECB * 8 + 6)
#define                                 CLC7IF_bit          _BIT_ACCESS(PIR6,6)
// IPR6<CLC7IP>
extern volatile __bit                   CLC7IP              __at(0x75DE);	// @ (0xEBB * 8 + 6)
#define                                 CLC7IP_bit          _BIT_ACCESS(IPR6,6)
// PMD3<CLC7MD>
extern volatile __bit                   CLC7MD              __at(0x76FE);	// @ (0xEDF * 8 + 6)
#define                                 CLC7MD_bit          _BIT_ACCESS(PMD3,6)
// PIE6<CLC8IE>
extern volatile __bit                   CLC8IE              __at(0x761F);	// @ (0xEC3 * 8 + 7)
#define                                 CLC8IE_bit          _BIT_ACCESS(PIE6,7)
// PIR6<CLC8IF>
extern volatile __bit                   CLC8IF              __at(0x765F);	// @ (0xECB * 8 + 7)
#define                                 CLC8IF_bit          _BIT_ACCESS(PIR6,7)
// IPR6<CLC8IP>
extern volatile __bit                   CLC8IP              __at(0x75DF);	// @ (0xEBB * 8 + 7)
#define                                 CLC8IP_bit          _BIT_ACCESS(IPR6,7)
// PMD3<CLC8MD>
extern volatile __bit                   CLC8MD              __at(0x76FF);	// @ (0xEDF * 8 + 7)
#define                                 CLC8MD_bit          _BIT_ACCESS(PMD3,7)
// CLCIN0PPS<CLCIN0PPS0>
extern volatile __bit                   CLCIN0PPS0          __at(0x70F8);	// @ (0xE1F * 8 + 0)
#define                                 CLCIN0PPS0_bit      _BIT_ACCESS(CLCIN0PPS,0)
// CLCIN0PPS<CLCIN0PPS1>
extern volatile __bit                   CLCIN0PPS1          __at(0x70F9);	// @ (0xE1F * 8 + 1)
#define                                 CLCIN0PPS1_bit      _BIT_ACCESS(CLCIN0PPS,1)
// CLCIN0PPS<CLCIN0PPS2>
extern volatile __bit                   CLCIN0PPS2          __at(0x70FA);	// @ (0xE1F * 8 + 2)
#define                                 CLCIN0PPS2_bit      _BIT_ACCESS(CLCIN0PPS,2)
// CLCIN0PPS<CLCIN0PPS3>
extern volatile __bit                   CLCIN0PPS3          __at(0x70FB);	// @ (0xE1F * 8 + 3)
#define                                 CLCIN0PPS3_bit      _BIT_ACCESS(CLCIN0PPS,3)
// CLCIN0PPS<CLCIN0PPS4>
extern volatile __bit                   CLCIN0PPS4          __at(0x70FC);	// @ (0xE1F * 8 + 4)
#define                                 CLCIN0PPS4_bit      _BIT_ACCESS(CLCIN0PPS,4)
// CLCIN1PPS<CLCIN1PPS0>
extern volatile __bit                   CLCIN1PPS0          __at(0x7100);	// @ (0xE20 * 8 + 0)
#define                                 CLCIN1PPS0_bit      _BIT_ACCESS(CLCIN1PPS,0)
// CLCIN1PPS<CLCIN1PPS1>
extern volatile __bit                   CLCIN1PPS1          __at(0x7101);	// @ (0xE20 * 8 + 1)
#define                                 CLCIN1PPS1_bit      _BIT_ACCESS(CLCIN1PPS,1)
// CLCIN1PPS<CLCIN1PPS2>
extern volatile __bit                   CLCIN1PPS2          __at(0x7102);	// @ (0xE20 * 8 + 2)
#define                                 CLCIN1PPS2_bit      _BIT_ACCESS(CLCIN1PPS,2)
// CLCIN1PPS<CLCIN1PPS3>
extern volatile __bit                   CLCIN1PPS3          __at(0x7103);	// @ (0xE20 * 8 + 3)
#define                                 CLCIN1PPS3_bit      _BIT_ACCESS(CLCIN1PPS,3)
// CLCIN1PPS<CLCIN1PPS4>
extern volatile __bit                   CLCIN1PPS4          __at(0x7104);	// @ (0xE20 * 8 + 4)
#define                                 CLCIN1PPS4_bit      _BIT_ACCESS(CLCIN1PPS,4)
// CLCIN2PPS<CLCIN2PPS0>
extern volatile __bit                   CLCIN2PPS0          __at(0x7108);	// @ (0xE21 * 8 + 0)
#define                                 CLCIN2PPS0_bit      _BIT_ACCESS(CLCIN2PPS,0)
// CLCIN2PPS<CLCIN2PPS1>
extern volatile __bit                   CLCIN2PPS1          __at(0x7109);	// @ (0xE21 * 8 + 1)
#define                                 CLCIN2PPS1_bit      _BIT_ACCESS(CLCIN2PPS,1)
