GopalSaraf/Practicals/PSDL/include/proc/pic18f46q10.h
#define                                 SLRD3_bit           _BIT_ACCESS(SLRCOND,3)
// SLRCOND<SLRD4>
extern volatile __bit                   SLRD4               __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 SLRD4_bit           _BIT_ACCESS(SLRCOND,4)
// SLRCOND<SLRD5>
extern volatile __bit                   SLRD5               __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 SLRD5_bit           _BIT_ACCESS(SLRCOND,5)
// SLRCOND<SLRD6>
extern volatile __bit                   SLRD6               __at(0x78F6);	// @ (0xF1E * 8 + 6)
#define                                 SLRD6_bit           _BIT_ACCESS(SLRCOND,6)
// SLRCOND<SLRD7>
extern volatile __bit                   SLRD7               __at(0x78F7);	// @ (0xF1E * 8 + 7)
#define                                 SLRD7_bit           _BIT_ACCESS(SLRCOND,7)
// SLRCONE<SLRE0>
extern volatile __bit                   SLRE0               __at(0x7930);	// @ (0xF26 * 8 + 0)
#define                                 SLRE0_bit           _BIT_ACCESS(SLRCONE,0)
// SLRCONE<SLRE1>
extern volatile __bit                   SLRE1               __at(0x7931);	// @ (0xF26 * 8 + 1)
#define                                 SLRE1_bit           _BIT_ACCESS(SLRCONE,1)
// SLRCONE<SLRE2>
extern volatile __bit                   SLRE2               __at(0x7932);	// @ (0xF26 * 8 + 2)
#define                                 SLRE2_bit           _BIT_ACCESS(SLRCONE,2)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x7CA7);	// @ (0xF94 * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x7487);	// @ (0xE90 * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// OSCSTAT<SOR>
extern volatile __bit                   SOR                 __at(0x76B3);	// @ (0xED6 * 8 + 3)
#define                                 SOR_bit             _BIT_ACCESS(OSCSTAT,3)
// OSCEN<SOSCEN>
extern volatile __bit                   SOSCEN              __at(0x76BB);	// @ (0xED7 * 8 + 3)
#define                                 SOSCEN_bit          _BIT_ACCESS(OSCEN,3)
// OSCCON3<SOSCPWR>
extern volatile __bit                   SOSCPWR             __at(0x76AE);	// @ (0xED5 * 8 + 6)
#define                                 SOSCPWR_bit         _BIT_ACCESS(OSCCON3,6)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// STKPTR<SP5>
extern volatile __bit                   SP5                 __at(0x7FE5);	// @ (0xFFC * 8 + 5)
#define                                 SP5_bit             _BIT_ACCESS(STKPTR,5)
// PMD0<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x76E1);	// @ (0xEDC * 8 + 1)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD0,1)
// PMD0<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x76E2);	// @ (0xEDC * 8 + 2)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD0,2)
// MDSRC<SRCS0>
extern volatile __bit                   SRCS0               __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 SRCS0_bit           _BIT_ACCESS(MDSRC,0)
// MDSRC<SRCS1>
extern volatile __bit                   SRCS1               __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 SRCS1_bit           _BIT_ACCESS(MDSRC,1)
// MDSRC<SRCS2>
extern volatile __bit                   SRCS2               __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 SRCS2_bit           _BIT_ACCESS(MDSRC,2)
// MDSRC<SRCS3>
extern volatile __bit                   SRCS3               __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 SRCS3_bit           _BIT_ACCESS(MDSRC,3)
// SSP1CLKPPS<SSP1CLKPPS0>
extern volatile __bit                   SSP1CLKPPS0         __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 SSP1CLKPPS0_bit     _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSP1CLKPPS1>
extern volatile __bit                   SSP1CLKPPS1         __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 SSP1CLKPPS1_bit     _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSP1CLKPPS2>
extern volatile __bit                   SSP1CLKPPS2         __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 SSP1CLKPPS2_bit     _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSP1CLKPPS3>
extern volatile __bit                   SSP1CLKPPS3         __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 SSP1CLKPPS3_bit     _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSP1CLKPPS4>
extern volatile __bit                   SSP1CLKPPS4         __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 SSP1CLKPPS4_bit     _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1DATPPS<SSP1DATPPS0>
extern volatile __bit                   SSP1DATPPS0         __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 SSP1DATPPS0_bit     _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSP1DATPPS1>
extern volatile __bit                   SSP1DATPPS1         __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 SSP1DATPPS1_bit     _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSP1DATPPS2>
extern volatile __bit                   SSP1DATPPS2         __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 SSP1DATPPS2_bit     _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSP1DATPPS3>
extern volatile __bit                   SSP1DATPPS3         __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 SSP1DATPPS3_bit     _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSP1DATPPS4>
extern volatile __bit                   SSP1DATPPS4         __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 SSP1DATPPS4_bit     _BIT_ACCESS(SSP1DATPPS,4)
// PIE3<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<SSP1IP>
extern volatile __bit                   SSP1IP              __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 SSP1IP_bit          _BIT_ACCESS(IPR3,0)
// SSP1SSPPS<SSP1SSPPS0>
extern volatile __bit                   SSP1SSPPS0          __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 SSP1SSPPS0_bit      _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSP1SSPPS1>
extern volatile __bit                   SSP1SSPPS1          __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 SSP1SSPPS1_bit      _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSP1SSPPS2>
extern volatile __bit                   SSP1SSPPS2          __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 SSP1SSPPS2_bit      _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSP1SSPPS3>
extern volatile __bit                   SSP1SSPPS3          __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 SSP1SSPPS3_bit      _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSP1SSPPS4>
extern volatile __bit                   SSP1SSPPS4          __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 SSP1SSPPS4_bit      _BIT_ACCESS(SSP1SSPPS,4)
// SSP2CLKPPS<SSP2CLKPPS0>
extern volatile __bit                   SSP2CLKPPS0         __at(0x7450);	// @ (0xE8A * 8 + 0)
#define                                 SSP2CLKPPS0_bit     _BIT_ACCESS(SSP2CLKPPS,0)
// SSP2CLKPPS<SSP2CLKPPS1>
extern volatile __bit                   SSP2CLKPPS1         __at(0x7451);	// @ (0xE8A * 8 + 1)
#define                                 SSP2CLKPPS1_bit     _BIT_ACCESS(SSP2CLKPPS,1)
// SSP2CLKPPS<SSP2CLKPPS2>
extern volatile __bit                   SSP2CLKPPS2         __at(0x7452);	// @ (0xE8A * 8 + 2)
#define                                 SSP2CLKPPS2_bit     _BIT_ACCESS(SSP2CLKPPS,2)
// SSP2CLKPPS<SSP2CLKPPS3>
extern volatile __bit                   SSP2CLKPPS3         __at(0x7453);	// @ (0xE8A * 8 + 3)
#define                                 SSP2CLKPPS3_bit     _BIT_ACCESS(SSP2CLKPPS,3)
// SSP2CLKPPS<SSP2CLKPPS4>
extern volatile __bit                   SSP2CLKPPS4         __at(0x7454);	// @ (0xE8A * 8 + 4)
#define                                 SSP2CLKPPS4_bit     _BIT_ACCESS(SSP2CLKPPS,4)
// SSP2DATPPS<SSP2DATPPS0>
extern volatile __bit                   SSP2DATPPS0         __at(0x7458);	// @ (0xE8B * 8 + 0)
#define                                 SSP2DATPPS0_bit     _BIT_ACCESS(SSP2DATPPS,0)
// SSP2DATPPS<SSP2DATPPS1>
extern volatile __bit                   SSP2DATPPS1         __at(0x7459);	// @ (0xE8B * 8 + 1)
#define                                 SSP2DATPPS1_bit     _BIT_ACCESS(SSP2DATPPS,1)
// SSP2DATPPS<SSP2DATPPS2>
extern volatile __bit                   SSP2DATPPS2         __at(0x745A);	// @ (0xE8B * 8 + 2)
#define                                 SSP2DATPPS2_bit     _BIT_ACCESS(SSP2DATPPS,2)
// SSP2DATPPS<SSP2DATPPS3>
extern volatile __bit                   SSP2DATPPS3         __at(0x745B);	// @ (0xE8B * 8 + 3)
#define                                 SSP2DATPPS3_bit     _BIT_ACCESS(SSP2DATPPS,3)
// SSP2DATPPS<SSP2DATPPS4>
extern volatile __bit                   SSP2DATPPS4         __at(0x745C);	// @ (0xE8B * 8 + 4)
#define                                 SSP2DATPPS4_bit     _BIT_ACCESS(SSP2DATPPS,4)
// PIE3<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<SSP2IP>
extern volatile __bit                   SSP2IP              __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 SSP2IP_bit          _BIT_ACCESS(IPR3,2)
// SSP2SSPPS<SSP2SSPPS0>
extern volatile __bit                   SSP2SSPPS0          __at(0x7460);	// @ (0xE8C * 8 + 0)
#define                                 SSP2SSPPS0_bit      _BIT_ACCESS(SSP2SSPPS,0)
// SSP2SSPPS<SSP2SSPPS1>
extern volatile __bit                   SSP2SSPPS1          __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 SSP2SSPPS1_bit      _BIT_ACCESS(SSP2SSPPS,1)
// SSP2SSPPS<SSP2SSPPS2>
extern volatile __bit                   SSP2SSPPS2          __at(0x7462);	// @ (0xE8C * 8 + 2)
#define                                 SSP2SSPPS2_bit      _BIT_ACCESS(SSP2SSPPS,2)
// SSP2SSPPS<SSP2SSPPS3>
extern volatile __bit                   SSP2SSPPS3          __at(0x7463);	// @ (0xE8C * 8 + 3)
#define                                 SSP2SSPPS3_bit      _BIT_ACCESS(SSP2SSPPS,3)
// SSP2SSPPS<SSP2SSPPS4>
extern volatile __bit                   SSP2SSPPS4          __at(0x7464);	// @ (0xE8C * 8 + 4)
#define                                 SSP2SSPPS4_bit      _BIT_ACCESS(SSP2SSPPS,4)
// SSP1CLKPPS<SSPCLKPPS0>
extern volatile __bit                   SSPCLKPPS0          __at(0x7590);	// @ (0xEB2 * 8 + 0)
#define                                 SSPCLKPPS0_bit      _BIT_ACCESS(SSP1CLKPPS,0)
// SSP1CLKPPS<SSPCLKPPS1>
extern volatile __bit                   SSPCLKPPS1          __at(0x7591);	// @ (0xEB2 * 8 + 1)
#define                                 SSPCLKPPS1_bit      _BIT_ACCESS(SSP1CLKPPS,1)
// SSP1CLKPPS<SSPCLKPPS2>
extern volatile __bit                   SSPCLKPPS2          __at(0x7592);	// @ (0xEB2 * 8 + 2)
#define                                 SSPCLKPPS2_bit      _BIT_ACCESS(SSP1CLKPPS,2)
// SSP1CLKPPS<SSPCLKPPS3>
extern volatile __bit                   SSPCLKPPS3          __at(0x7593);	// @ (0xEB2 * 8 + 3)
#define                                 SSPCLKPPS3_bit      _BIT_ACCESS(SSP1CLKPPS,3)
// SSP1CLKPPS<SSPCLKPPS4>
extern volatile __bit                   SSPCLKPPS4          __at(0x7594);	// @ (0xEB2 * 8 + 4)
#define                                 SSPCLKPPS4_bit      _BIT_ACCESS(SSP1CLKPPS,4)
// SSP1DATPPS<SSPDATPPS0>
extern volatile __bit                   SSPDATPPS0          __at(0x7598);	// @ (0xEB3 * 8 + 0)
#define                                 SSPDATPPS0_bit      _BIT_ACCESS(SSP1DATPPS,0)
// SSP1DATPPS<SSPDATPPS1>
extern volatile __bit                   SSPDATPPS1          __at(0x7599);	// @ (0xEB3 * 8 + 1)
#define                                 SSPDATPPS1_bit      _BIT_ACCESS(SSP1DATPPS,1)
// SSP1DATPPS<SSPDATPPS2>
extern volatile __bit                   SSPDATPPS2          __at(0x759A);	// @ (0xEB3 * 8 + 2)
#define                                 SSPDATPPS2_bit      _BIT_ACCESS(SSP1DATPPS,2)
// SSP1DATPPS<SSPDATPPS3>
extern volatile __bit                   SSPDATPPS3          __at(0x759B);	// @ (0xEB3 * 8 + 3)
#define                                 SSPDATPPS3_bit      _BIT_ACCESS(SSP1DATPPS,3)
// SSP1DATPPS<SSPDATPPS4>
extern volatile __bit                   SSPDATPPS4          __at(0x759C);	// @ (0xEB3 * 8 + 4)
#define                                 SSPDATPPS4_bit      _BIT_ACCESS(SSP1DATPPS,4)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x7CAD);	// @ (0xF95 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0x748D);	// @ (0xE91 * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// PIE3<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE3,0)
// PIR3<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR3,0)
// IPR3<SSPIP>
extern volatile __bit                   SSPIP               __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR3,0)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x7CA8);	// @ (0xF95 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0x7488);	// @ (0xE91 * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x7CA9);	// @ (0xF95 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0x7489);	// @ (0xE91 * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x7CAA);	// @ (0xF95 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0x748A);	// @ (0xE91 * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x7CAB);	// @ (0xF95 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0x748B);	// @ (0xE91 * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x7CAE);	// @ (0xF95 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x748E);	// @ (0xE91 * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1SSPPS<SSPSSPPS0>
extern volatile __bit                   SSPSSPPS0           __at(0x75A0);	// @ (0xEB4 * 8 + 0)
#define                                 SSPSSPPS0_bit       _BIT_ACCESS(SSP1SSPPS,0)
// SSP1SSPPS<SSPSSPPS1>
extern volatile __bit                   SSPSSPPS1           __at(0x75A1);	// @ (0xEB4 * 8 + 1)
#define                                 SSPSSPPS1_bit       _BIT_ACCESS(SSP1SSPPS,1)
// SSP1SSPPS<SSPSSPPS2>
extern volatile __bit                   SSPSSPPS2           __at(0x75A2);	// @ (0xEB4 * 8 + 2)
#define                                 SSPSSPPS2_bit       _BIT_ACCESS(SSP1SSPPS,2)
// SSP1SSPPS<SSPSSPPS3>
extern volatile __bit                   SSPSSPPS3           __at(0x75A3);	// @ (0xEB4 * 8 + 3)
#define                                 SSPSSPPS3_bit       _BIT_ACCESS(SSP1SSPPS,3)
// SSP1SSPPS<SSPSSPPS4>
extern volatile __bit                   SSPSSPPS4           __at(0x75A4);	// @ (0xEB4 * 8 + 4)
#define                                 SSPSSPPS4_bit       _BIT_ACCESS(SSP1SSPPS,4)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x7CA3);	// @ (0xF94 * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// WDTTMR<STATE>
extern volatile __bit                   STATE               __at(0x768A);	// @ (0xED1 * 8 + 2)
#define                                 STATE_bit           _BIT_ACCESS(WDTTMR,2)
// PCON0<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7EBF);	// @ (0xFD7 * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(PCON0,7)
// STKPTR<STKPTR0>
extern volatile __bit                   STKPTR0             __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 STKPTR0_bit         _BIT_ACCESS(STKPTR,0)
// STKPTR<STKPTR1>
extern volatile __bit                   STKPTR1             __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 STKPTR1_bit         _BIT_ACCESS(STKPTR,1)
// STKPTR<STKPTR2>
extern volatile __bit                   STKPTR2             __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 STKPTR2_bit         _BIT_ACCESS(STKPTR,2)
// STKPTR<STKPTR3>
extern volatile __bit                   STKPTR3             __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 STKPTR3_bit         _BIT_ACCESS(STKPTR,3)
// STKPTR<STKPTR4>
extern volatile __bit                   STKPTR4             __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 STKPTR4_bit         _BIT_ACCESS(STKPTR,4)
// STKPTR<STKPTR5>
extern volatile __bit                   STKPTR5             __at(0x7FE5);	// @ (0xFFC * 8 + 5)
#define                                 STKPTR5_bit         _BIT_ACCESS(STKPTR,5)
// PCON0<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7EBE);	// @ (0xFD7 * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(PCON0,6)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x7CA4);	// @ (0xF94 * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// CWG1STR<STRA>
extern volatile __bit                   STRA                __at(0x7A18);	// @ (0xF43 * 8 + 0)
#define                                 STRA_bit            _BIT_ACCESS(CWG1STR,0)
// CWG1STR<STRB>
extern volatile __bit                   STRB                __at(0x7A19);	// @ (0xF43 * 8 + 1)
#define                                 STRB_bit            _BIT_ACCESS(CWG1STR,1)
// CWG1STR<STRC>
extern volatile __bit                   STRC                __at(0x7A1A);	// @ (0xF43 * 8 + 2)
#define                                 STRC_bit            _BIT_ACCESS(CWG1STR,2)
// CWG1STR<STRD>
extern volatile __bit                   STRD                __at(0x7A1B);	// @ (0xF43 * 8 + 3)
#define                                 STRD_bit            _BIT_ACCESS(CWG1STR,3)
// WDTCON0<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON0,0)
// PMD0<SYSCMD>
extern volatile __bit                   SYSCMD              __at(0x76E7);	// @ (0xEDC * 8 + 7)
#define                                 SYSCMD_bit          _BIT_ACCESS(PMD0,7)
// T0CON0<T016BIT>
extern volatile __bit                   T016BIT             __at(0x7EA4);	// @ (0xFD4 * 8 + 4)
#define                                 T016BIT_bit         _BIT_ACCESS(T0CON0,4)
// T0CON1<T0ASYNC>
extern volatile __bit                   T0ASYNC             __at(0x7EAC);	// @ (0xFD5 * 8 + 4)
#define                                 T0ASYNC_bit         _BIT_ACCESS(T0CON1,4)
// T0CKIPPS<T0CKIPPS0>
extern volatile __bit                   T0CKIPPS0           __at(0x74F8);	// @ (0xE9F * 8 + 0)
#define                                 T0CKIPPS0_bit       _BIT_ACCESS(T0CKIPPS,0)
// T0CKIPPS<T0CKIPPS1>
extern volatile __bit                   T0CKIPPS1           __at(0x74F9);	// @ (0xE9F * 8 + 1)
#define                                 T0CKIPPS1_bit       _BIT_ACCESS(T0CKIPPS,1)
// T0CKIPPS<T0CKIPPS2>
extern volatile __bit                   T0CKIPPS2           __at(0x74FA);	// @ (0xE9F * 8 + 2)
#define                                 T0CKIPPS2_bit       _BIT_ACCESS(T0CKIPPS,2)
// T0CKIPPS<T0CKIPPS3>
extern volatile __bit                   T0CKIPPS3           __at(0x74FB);	// @ (0xE9F * 8 + 3)
#define                                 T0CKIPPS3_bit       _BIT_ACCESS(T0CKIPPS,3)
// T0CON1<T0CKPS0>
extern volatile __bit                   T0CKPS0             __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0CKPS0_bit         _BIT_ACCESS(T0CON1,0)
// T0CON1<T0CKPS1>
extern volatile __bit                   T0CKPS1             __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0CKPS1_bit         _BIT_ACCESS(T0CON1,1)
// T0CON1<T0CKPS2>
extern volatile __bit                   T0CKPS2             __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0CKPS2_bit         _BIT_ACCESS(T0CON1,2)
// T0CON1<T0CKPS3>
extern volatile __bit                   T0CKPS3             __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 T0CKPS3_bit         _BIT_ACCESS(T0CON1,3)
// T0CON1<T0CS0>
extern volatile __bit                   T0CS0               __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
